# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

my_list = [1, 1, 1, 2, 6, 8, 9, 9, 8, 10, 30, 3, 80, 9, 80, 10, 70, 70]
my_list2 = set(my_list)
print(list(my_list2))




